CNN-based character feature extraction model for text:

Model: "char_CNN_encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 256, 16)      1328        input_1[0][0]                    
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 253, 3)       195         embedding_1[0][0]                
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 252, 200)     16200       embedding_1[0][0]                
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 251, 300)     29100       embedding_1[0][0]                
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 251, 5)       50          conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 250, 300)     180300      conv1d_3[0][0]                   
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 249, 400)     360400      conv1d_6[0][0]                   
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 249, 7)       112         conv1d_1[0][0]                   
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 248, 300)     270300      conv1d_4[0][0]                   
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 247, 400)     480400      conv1d_7[0][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 249, 7)       0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 248, 300)     0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 247, 400)     0           conv1d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 124, 7)       0           dropout[0][0]                    
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 124, 300)     0           dropout_1[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 123, 400)     0           dropout_2[0][0]                  
__________________________________________________________________________________________________
global_max_pooling1d (GlobalMax (None, 7)            0           max_pooling1d[0][0]              
__________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalM (None, 300)          0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
global_max_pooling1d_2 (GlobalM (None, 400)          0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          1024        global_max_pooling1d[0][0]       
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          38528       global_max_pooling1d_1[0][0]     
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 128)          51328       global_max_pooling1d_2[0][0]     
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 384)          0           dense[0][0]                      
                                                                 dense_1[0][0]                    
                                                                 dense_2[0][0]                    
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 384)          0           concatenate[0][0]                
==================================================================================================
Total params: 1,429,265
Trainable params: 1,429,265
Non-trainable params: 0
__________________________________________________________________________________________________


Character level sentence embedding model:

Model: "char_seq_encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 5, 256)]          0         
_________________________________________________________________
time_distributed_char_cnn (T (None, 5, 384)            1429265   
_________________________________________________________________
char_seq (Bidirectional)     (None, 256)               525312    
_________________________________________________________________
dropout_4 (Dropout)          (None, 256)               0         
=================================================================
Total params: 1,954,577
Trainable params: 1,954,577
Non-trainable params: 0
_________________________________________________________________


Final hybrid word plus character siamese model:

Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
left_word_input (InputLayer)    [(None, 256)]        0                                            
__________________________________________________________________________________________________
right_word_input (InputLayer)   [(None, 256)]        0                                            
__________________________________________________________________________________________________
embedding (Embedding)           (None, 256, 300)     36395700    left_word_input[0][0]            
                                                                 right_word_input[0][0]           
__________________________________________________________________________________________________
left_char_input (InputLayer)    [(None, 5, 256)]     0                                            
__________________________________________________________________________________________________
right_char_input (InputLayer)   [(None, 5, 256)]     0                                            
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 100)          105600      embedding[0][0]                  
                                                                 embedding[1][0]                  
__________________________________________________________________________________________________
char_seq_encoder (Model)        (None, 256)          1954577     left_char_input[0][0]            
                                                                 right_char_input[0][0]           
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 356)          0           bidirectional[0][0]              
                                                                 char_seq_encoder[1][0]           
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 356)          0           bidirectional[1][0]              
                                                                 char_seq_encoder[2][0]           
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 1)            0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
==================================================================================================
Total params: 38,455,877
Trainable params: 2,060,177
Non-trainable params: 36,395,700
__________________________________________________________________________________________________
